src/Documents/СписаниеЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>СписаниеЗапасов</Name>
			<BasedOn>
				<xr:Item>Document.ИнвентаризацияЗапасов</xr:Item>
				<xr:Item>Document.Поступление</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ЗапасыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поступление</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияЗапасов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Comment>Статья расходов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникРасхода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Comment>Статья расходов</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СотрудникРасхода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Специализация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ИнвентаризацияЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ИнвентаризацияЗапасов</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборИнвентаризации</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУчет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отклонение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковокПоДаннымУчета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПоДаннымУчета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоВБазовыхЕИ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикиИспользуются</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/СписаниеЗапасов/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

// Процедура - обработчик события "ОбработкаЗаполнения" объекта
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)  Экспорт
	
	 Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ИнвентаризацияЗапасов") И ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		
		 Если Не ЗначениеЗаполнено(ЭтотОбъект.ДокументОснование) Тогда
			 ЭтотОбъект.ДокументОснование = ДанныеЗаполнения.Ссылка;
		 КонецЕсли;
		 Если Не ЗначениеЗаполнено(Склад) Тогда
			 Склад = ДанныеЗаполнения.Склад;
		 КонецЕсли;
		 
		 Если Не ЗначениеЗаполнено(ВидОперации) Тогда
			ВидОперации = ДанныеЗаполнения.ВидОперации;
		 КонецЕсли;
		
		 Если Не ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
			 СтруктурнаяЕдиница = ДанныеЗаполнения.СтруктурнаяЕдиница;
		 КонецЕсли;
		 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	МИНИМУМ(ИнвентаризацияЗапасов.НомерСтроки) КАК НомерСтроки,
		               |	ИнвентаризацияЗапасов.Номенклатура КАК Номенклатура,
		               |	ИнвентаризацияЗапасов.Партия КАК Партия,
		               |	ИнвентаризацияЗапасов.Упаковка КАК Упаковка,
		               |	СУММА(ИнвентаризацияЗапасов.КоличествоУпаковокПоДаннымУчета - ИнвентаризацияЗапасов.КоличествоУпаковок) КАК КоличествоОтклонениеИнвентаризацииУпаковок,
		               |	СУММА(ИнвентаризацияЗапасов.КоличествоПоДаннымУчета - ИнвентаризацияЗапасов.Количество) КАК КоличествоОтклонениеИнвентаризации,
		               |	СУММА(ВЫБОР
		               |			КОГДА СписаниеЗапасов.КоличествоУпаковок ЕСТЬ NULL 
		               |				ТОГДА 0
		               |			ИНАЧЕ СписаниеЗапасов.КоличествоУпаковок
		               |		КОНЕЦ) КАК КоличествоСписанноеУпаковок,
		               |	СУММА(ВЫБОР
		               |			КОГДА СписаниеЗапасов.Количество ЕСТЬ NULL 
		               |				ТОГДА 0
		               |			ИНАЧЕ СписаниеЗапасов.Количество
		               |		КОНЕЦ) КАК КоличествоСписанное
		               |ИЗ
		               |	Документ.ИнвентаризацияЗапасов.Запасы КАК ИнвентаризацияЗапасов
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СписаниеЗапасов.Запасы КАК СписаниеЗапасов
		               |		ПО ИнвентаризацияЗапасов.Номенклатура = СписаниеЗапасов.Номенклатура
		               |			И ИнвентаризацияЗапасов.Партия = СписаниеЗапасов.Партия
		               |			И ИнвентаризацияЗапасов.Ссылка = СписаниеЗапасов.Ссылка.ДокументОснование
		               |			И (СписаниеЗапасов.Ссылка <> &ДокументСсылка)
		               |			И (СписаниеЗапасов.Ссылка.Проведен)
		               |ГДЕ
		               |	ИнвентаризацияЗапасов.Ссылка = &ДокументОснование
		               |	И ИнвентаризацияЗапасов.КоличествоУпаковокПоДаннымУчета - ИнвентаризацияЗапасов.КоличествоУпаковок > 0
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ИнвентаризацияЗапасов.Номенклатура,
		               |	ИнвентаризацияЗапасов.Партия,
		               |	ИнвентаризацияЗапасов.Упаковка
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	НомерСтроки";
		
	
		
		Запрос.УстановитьПараметр("ДокументОснование", ДанныеЗаполнения);
		Запрос.УстановитьПараметр("ДокументСсылка"   , Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			
			// Заполнение табличной части документа.	
			Запасы.Очистить();
	        		
			Пока Выборка.Следующий() Цикл    
				КоличествоСписатьУпаковок = Выборка.КоличествоОтклонениеИнвентаризацииУпаковок - Выборка.КоличествоСписанноеУпаковок;   
				КоличествоСписать         = Выборка.КоличествоОтклонениеИнвентаризации - Выборка.КоличествоСписанное;
				Если КоличествоСписатьУпаковок <= 0 Тогда
					Продолжить;
				КонецЕсли;                               			
				СтрокаТабличнойЧасти                    = Запасы.Добавить();
	            СтрокаТабличнойЧасти.Номенклатура       = Выборка.Номенклатура;
				СтрокаТабличнойЧасти.Партия 			= Выборка.Партия;
				СтрокаТабличнойЧасти.Упаковка           = Выборка.Упаковка;
				СтрокаТабличнойЧасти.КоличествоУпаковок = КоличествоСписатьУпаковок;
				СтрокаТабличнойЧасти.Количество         = КоличествоСписать; 
				СтрокаТабличнойЧасти.Склад              = Склад;
			КонецЦикла;    			
		КонецЕсли;
		
		Если Запасы.Количество() = 0 Тогда
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru = 'Нет данных для оформления списания!'");
			Сообщение.Сообщить();
			
			СтандартнаяОбработка = Ложь;
			
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Поступление") Тогда
		
		ДокументОснование = ДанныеЗаполнения;
		Склад = ДанныеЗаполнения.Склад;
		СтруктурнаяЕдиница = ДанныеЗаполнения.СтруктурнаяЕдиница;
		
		Для Каждого СтрокаЗапасы Из ДанныеЗаполнения.Запасы Цикл
			СтрокаТЧ = Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаЗапасы);
			СтрокаТЧ.Склад         = ДанныеЗаполнения.Склад;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		    И ДанныеЗаполнения.Свойство("ВидОперации") Тогда
		
		ВидОперации = ДанныеЗаполнения.ВидОперации;
        Если ВидОперации = Перечисления.ВидыОпераций.ПоСкладу Тогда
			Склад        = Справочники.Склады.ПустаяСсылка();
		ИначеЕсли ВидОперации = Перечисления.ВидыОпераций.ПоСотруднику Тогда
			Склад        = Справочники.Сотрудники.ПустаяСсылка();
		КонецЕсли;
		
	КонецЕсли;

	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, , ДанныеЗаполнения);
	
КонецПроцедуры

// Процедура - обработчик события "ПриКопировании" объекта
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, ОбъектКопирования);
	                       
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	
	// Инициализация дополнительных свойств для проведения документа.
	ДвиженияДокументовСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.СписаниеЗапасов.УстановитьНачальныеДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
    ДополнительныеСвойства.Вставить("СтруктураПолейПерегрузка", Новый Структура("Склад", "Склад"));	
	УправлениеЗапасамиПартионныйУчет.СформироватьСписаниеТаблицаПартииТоваров(Ссылка.Запасы, ДополнительныеСвойства, Движения, Отказ);
	// Движения по регистрам
	ДвиженияДокументовСервер.ЗапасыНаСкладах(ДополнительныеСвойства, Движения, Отказ);   	
	ДвиженияДокументовСервер.ПартииТоваров(ДополнительныеСвойства, Движения, Отказ);
	ТаблицаУправленческийДобавитьДвиженияПоПартиям(ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУправленческий
	                                              ,ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПартииТоваров);
	ДвиженияДокументовСервер.Управленческий(ДополнительныеСвойства, Движения, Отказ);

	// Запись наборов записей.
	ДвиженияДокументовСервер.ДобавитьНаборыЗаписей(ЭтотОбъект);
	
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура добавляет необходимы движения по партиям 
// в таблицу движений регистра управленческий
Процедура ТаблицаУправленческийДобавитьДвиженияПоПартиям(ТаблицаУправленческий, ТаблицаПартии)	
	
	ВременнаяТаблица = ТаблицаПартии.Скопировать();
    ВременнаяТаблица.Свернуть("Номенклатура,Склад","Стоимость,Количество");	
	Для Каждого СтрокаТ ИЗ ВременнаяТаблица Цикл	
		НайденныеСтроки = ТаблицаУправленческий.НайтиСтроки(Новый Структура("СубконтоКт1,СубконтоКт2",СтрокаТ.Номенклатура,СтрокаТ.Склад));
		Если НайденныеСтроки.Количество() > 0 Тогда
			НайденныеСтроки[0].Сумма              = СтрокаТ.Стоимость;
			НайденныеСтроки[0].Количество         = СтрокаТ.Количество;
		КонецЕсли;
	КонецЦикла;		
КонецПроцедуры


#КонецОбласти
